logs/sysbench/201905/20190522_2_4/thread_w02_20190603092206.log
sysbench 1.1.0-faaff4f (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 3325.72 qps: 19963.60 (r/w/o: 0.00/13309.17/6654.43) lat (ms,95%): 27.17 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 3277.72 qps: 19669.21 (r/w/o: 0.00/13113.77/6555.44) lat (ms,95%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 3305.09 qps: 19825.52 (r/w/o: 0.00/13215.85/6609.67) lat (ms,95%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 3307.71 qps: 19850.28 (r/w/o: 0.00/13234.45/6615.83) lat (ms,95%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 3373.95 qps: 20238.62 (r/w/o: 0.00/13490.91/6747.71) lat (ms,95%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 3365.07 qps: 20190.85 (r/w/o: 0.00/13461.10/6729.75) lat (ms,95%): 28.16 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           798404
        other:                           399202
        total:                           1197606
    transactions:                        199601 (3325.88 per sec.)
    queries:                             1197606 (19955.27 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      3325.8776
    time elapsed:                        60.0145s
    total number of events:              199601

Latency (ms):
         min:                                    0.82
         avg:                                    9.62
         max:                                  131.26
         95th percentile:                       27.66
         sum:                              1919642.08

Threads fairness:
    events (avg/stddev):           6237.5312/117.72
    execution time (avg/stddev):   59.9888/0.00